src/cf/InformationRegisters/РегистрацияТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключатьВНалоговуюБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостановкаНаУчетВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПостановкаНаУчетВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаТранспортногоСредства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияНалоговойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяЛьгота</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговыхЛьготПоТранспортномуНалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговойЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛьготнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентУменьшения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУменьшения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегиональныйКодЛьготы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭкологическийКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭкологическийКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСобственность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавкаЗависитОтГодаВыпускаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗарегистрированоВРеестреСистемыПлатон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗаписиОРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/УправлениеВнеоборотнымиАктивамиВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СообщениеОНаличииТранспортаИЗемли

// Возвращает структуру со значениями полей страницы транспортного средства сообщения о наличии ТС и зем. участков.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которой подается сообщение о наличии ТС.
//  ТранспортноеСредство - СправочникСсылка.ОсноныеСредства - транспортное средство, по которому заполняется страница сообщения.
//  Период - дата - дата окончания отчетного периода, за который подается сообщение.
//
Функция ДанныеСтраницыТранспортногоСредства(Организация, ТранспортноеСредство, Период) Экспорт
	
	// Структура со значениями полей страницы транспортного средства
	ДанныеСтраницы = Новый Структура;
	ДанныеСтраницы.Вставить("ВидТС");        // вид транспортного средства
	ДанныеСтраницы.Вставить("ИдНомТС");      // идентификационный номер (VIN)
	ДанныеСтраницы.Вставить("МаркаТС");      // марка
	ДанныеСтраницы.Вставить("РегЗнакТС");    // регистрационный знак
	ДанныеСтраницы.Вставить("ДатаРегТС");    // дата регистрации
	ДанныеСтраницы.Вставить("ДатаСнУчетТС"); // дата снятия с учета
		
	Запрос = Новый Запрос;
	Запрос.Текст = УправлениеВнеоборотнымиАктивами.ТекстЗапросаВыборкиТранспортныхСредствДляСообщенияВФНС(Истина);
	
	Запрос.УстановитьПараметр("Организации", ОбщегоНазначенияБПВызовСервераПовтИсп.ВсяОрганизация(Организация));
	Запрос.УстановитьПараметр("ПериодРасчета", 	Период);
	Запрос.УстановитьПараметр("ОсновноеСредство", ТранспортноеСредство);	
	
	ВыборкаТС = Запрос.Выполнить().Выбрать();
			
	Если ВыборкаТС.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ДанныеСтраницы, ВыборкаТС);
		
		// Подготовим таблицу соответствия кодов видов ТС, использовавашихся в декларации по транспортному налогу,
		// и номеров категорий ТС, используемых в заявлении на льготу 
		Макет = РегистрыСведений.РегистрацияТранспортныхСредств.ПолучитьМакет("КодыВидовИКатегорииТС");
		КодыВидовИКатегорииТС = ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет.ПолучитьТекст()).Данные;
				
		НайденнаяСтрока = КодыВидовИКатегорииТС.Найти(ВыборкаТС.КодВидаТС, "КодВида");
		Если НайденнаяСтрока <> Неопределено Тогда
			ДанныеСтраницы.ВидТС = НайденнаяСтрока.НомерКатегории;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеСтраницы;
			
КонецФункции

// Возвращает структуру со значениями полей страницы земельного участка сообщения о наличии ТС и зем. участков.
//
// Параметры:
//  Организация - СправочникСсылка.Организации - организация, по которой подается сообщение о наличии земельных участков.
//  ЗемельныйУчасток - СправочникСсылка.ОсноныеСредства - земельный участок, по которому заполняется страница сообщения.
//  Период - дата - дата окончания отчетного периода, за который подается сообщение.
//
Функция ДанныеСтраницыЗемельногоУчастка(Организация, ЗемельныйУчасток, Период) Экспорт
	
	// Структура со значениями полей страницы земельного участка
	ДанныеСтраницы = Новый Структура;
	ДанныеСтраницы.Вставить("НомКадастрЗУ");  // кадастровый номер земельного участка
	ДанныеСтраницы.Вставить("ДатаРегПрав");   // дата регистрации (возникновения) права на участок
	ДанныеСтраницы.Вставить("ДатаПрекрПрав"); // дата прекращения права
	ДанныеСтраницы.Вставить("Комментарий");   // наименование основного средства в программе (служебное поле)

	Запрос = Новый Запрос;
	Запрос.Текст = УправлениеВнеоборотнымиАктивами.ТекстЗапросаВыборкиЗемельныхУчастковДляСообщенияВФНС(Истина);
	
	Запрос.УстановитьПараметр("Организации", ОбщегоНазначенияБПВызовСервераПовтИсп.ВсяОрганизация(Организация));
	Запрос.УстановитьПараметр("ПериодРасчета", Период);
	Запрос.УстановитьПараметр("ОсновноеСредство", ЗемельныйУчасток);	
	
	ВыборкаЗУ = Запрос.Выполнить().Выбрать();
			
	Если ВыборкаЗУ.Следующий() Тогда		
		ЗаполнитьЗначенияСвойств(ДанныеСтраницы, ВыборкаЗУ);					
	КонецЕсли;
	
	Возврат ДанныеСтраницы;
			
КонецФункции

// Определяет дату окончания отчетного периода (последнего предшествующего), за который подается уведомление.
// 
// Параметры:
//  ДатаСообщения - Дата - предполагаемая дата подачи сообщения, обычно дата подписи.
// 
// Возвращаемое значение:
//  Дата - окончания последнего отчетного периода, который предшествует дате уведомления 
// и за который это уведомление подается.
//
Функция ПоследнийОтчетныйПериодПоДатеУведомления(Знач ДатаСообщения) Экспорт
	
	ДатаСообщения = ?(ЗначениеЗаполнено(ДатаСообщения), ДатаСообщения, ОбщегоНазначения.ТекущаяДатаПользователя());
	Возврат	НачалоДня(НачалоГода(ДатаСообщения)-1); // конец прошлого года
	
КонецФункции

#КонецОбласти

#КонецОбласти
